# From https://www.thairath.co.th/lifestyle/life/2272461
string = "กระต่ายหลงตัวเอง ชอบโอ้อวดว่าวิ่งเร็วกว่าใครๆ เมื่อเห็นเต่าเดินต้วมเตี้ยมมาก็หัวเราะเยาะ พร้อมกับพูดจาถากถางว่าต่อให้เต่าวิ่งนำหน้าไปก่อน กระต่ายก็สามารถก็แซงหน้าได้อยู่ดี ทำให้เต่าเกิดความไม่พอใจ จึงท้ากระต่ายวิ่งแข่งกัน กระต่ายเริ่มวิ่งนำหน้าเต่าไปไกล แต่เมื่อไปถึงครึ่งทาง ก็เกิดความชะล่าใจ หยุดพักเอนกายนอนใต้ต้นไม้ใหญ่จนเผลอหลับไป ในขณะที่เต่ายังคงเดินต่อไปเรื่อยๆ อย่างไม่ลดละ เมื่อกระต่ายตื่นนอนขึ้นมาก็ตกใจ รีบลนลานวิ่งไปยังเส้นชัย ทว่าเต่าไปถึงเส้นชัยก่อนแล้ว"
thai_ch = "กขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรฤฤๅลฦฦๅวศษสหฬอฮ"

### BEGIN SOLUTION
dic={'ก':0,'ข':0,'ฃ':0,'ค':0,'ฅ':0,'ฆ':0,'ง':0,'จ':0,'ฉ':0,'ช':0,'ซ':0,'ฌ':0,'ญ':0,'ฎ':0,'ฏ':0,'ฐ':0,'ฑ':0,\
     'ฒ':0,'ณ':0,'ด':0,'ต':0,'ถ':0,'ท':0,'ธ':0,'น':0,'บ':0,'ป':0,'ผ':0,'ฝ':0,'พ':0,'ฟ':0,'ภ':0,'ม':0,'ย':0,\
     'ร':0,'ฤ':0,'ฤ':0,'ๅ':0,'ล':0,'ฦ':0,'ฦ':0,'ๅ':0,'ว':0,'ศ':0,'ษ':0,'ส':0,'ห':0,'ฬ':0,'อ':0,'ฮ':0}
summ=0
for i in string:
    if(dic.get(i)!=None):
        dic[i]+=1
        summ+=1
print('1.จำนวนพยัญชนะทั้งหมดที่อยู่ประโยค: ',summ)

print('2.พยัญชนะที่ถูกใช้: ',end='')
c=1
for i in dic:
    if(dic[i]):
        if(c):
            print(i,end='')
            c=0
        else:
            print(',',i,sep='',end='')
            
print('\n3.พยัญชนะแต่ละตัว (ที่ถูกใช้ในข้อ 2) ถูกใช้ซ้ำกี่ครั้ง: ')
dic = {k: v for k, v in dic.items() if v}
print(dic)
### END SOLUTION
